cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF11xT.xml
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description>Port function setting register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description>Bit2 of PFR6</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of PFR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of PFR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR7" -->
        <register>
          <name>PFR7</name>
          <description>Port function setting register 7</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P7F" -->
            <field>
              <name>P7F</name>
              <description>Bit15 of PFR7</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7E" -->
            <field>
              <name>P7E</name>
              <description>Bit14 of PFR7</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7D" -->
            <field>
              <name>P7D</name>
              <description>Bit13 of PFR7</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7C" -->
            <field>
              <name>P7C</name>
              <description>Bit12 of PFR7</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7B" -->
            <field>
              <name>P7B</name>
              <description>Bit11 of PFR7</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7A" -->
            <field>
              <name>P7A</name>
              <description>Bit10 of PFR7</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P79" -->
            <field>
              <name>P79</name>
              <description>Bit9 of PFR7</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P78" -->
            <field>
              <name>P78</name>
              <description>Bit8 of PFR7</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P77" -->
            <field>
              <name>P77</name>
              <description>Bit7 of PFR7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P76" -->
            <field>
              <name>P76</name>
              <description>Bit6 of PFR7</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P75" -->
            <field>
              <name>P75</name>
              <description>Bit5 of PFR7</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P74" -->
            <field>
              <name>P74</name>
              <description>Bit4 of PFR7</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P73" -->
            <field>
              <name>P73</name>
              <description>Bit3 of PFR7</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P72" -->
            <field>
              <name>P72</name>
              <description>Bit2 of PFR7</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P71" -->
            <field>
              <name>P71</name>
              <description>Bit1 of PFR7</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P70" -->
            <field>
              <name>P70</name>
              <description>Bit0 of PFR7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description>Port function setting register 8</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P83" -->
            <field>
              <name>P83</name>
              <description>Bit3 of PFR8</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P82" -->
            <field>
              <name>P82</name>
              <description>Bit2 of PFR8</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description>Bit1 of PFR8</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description>Bit0 of PFR8</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
